---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticalNodeConnectionStatus
source: html/f02762c1-d9b8-707e-ccc7-e80e85562691.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticalNodeConnectionStatus Property

"Connection Status"

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticalNodeConnectionStatus { get; }
```